In [2]:
import pandas as pd

In [3]:
ship = pd.read_csv(r"C:\Users\ryank\Downloads\titanic.csv")

In [4]:
ship

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
ship.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [12]:
ship.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [25]:
ship.Age.median()

np.float64(28.0)

In [24]:
Age_median = ship.Age.median()
Age_median

np.float64(28.0)

In [27]:
ship['Age_med']

0      None
1      None
2      None
3      None
4      None
       ...
886    None
887    None
888    None
889    None
890    None
Name: Age_med, Length: 891, dtype: object

In [28]:
ship['Age_med_new'] = ship.Age_med.fillna(Age_median, inplace = True)

C:\Users\ryank\AppData\Local\Temp\ipykernel_824\4062558474.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  ship['Age_med_new'] = ship.Age_med.fillna(Age_median, inplace = True)

In [29]:
ship.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
 12  Age_med      891 non-null    float64
 13  Age_med_new  0 non-null      object
dtypes: float64(3), int64(5), object(6)
memory usage: 97.6+ KB

In [30]:
ship.Age_med.isnull().sum()

np.int64(0)

In [33]:
ship.Sex.value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [41]:
#imput missing values in age using the mean age of passengers of the same sex 
male_ship = ship['Sex'] == 'male'

In [42]:
mean_age = ship.Age.mean()
mean_age

np.float64(29.36158249158249)

In [54]:
ship['Age_mean_sex'] = ship.groupby('Sex')['Age'].transform(lambda x:x.fillna(x.mean()))
ship['Age_mean_sex']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: Age_mean_sex, Length: 891, dtype: float64

In [57]:
ship[ship['Age_mean_sex'].isnull()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked, Age_med, Age_med_new, Age_mean_sex]
Index: []

In [48]:
ship.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PassengerId   891 non-null    int64
 1   Survived      891 non-null    int64
 2   Pclass        891 non-null    int64
 3   Name          891 non-null    object
 4   Sex           891 non-null    object
 5   Age           891 non-null    float64
 6   SibSp         891 non-null    int64
 7   Parch         891 non-null    int64
 8   Ticket        891 non-null    object
 9   Fare          891 non-null    float64
 10  Cabin         204 non-null    object
 11  Embarked      889 non-null    object
 12  Age_med       891 non-null    float64
 13  Age_med_new   0 non-null      object
 14  Age_mean_sex  891 non-null    float64
dtypes: float64(4), int64(5), object(6)
memory usage: 104.5+ KB

In [61]:
#impute the missing value sin cabin and store it in the original cabin column
ship.isnull().sum()

PassengerId       0
Survived          0
Pclass            0
Name              0
Sex               0
Age               0
SibSp             0
Parch             0
Ticket            0
Fare              0
Cabin           687
Embarked          2
Age_med           0
Age_med_new     891
Age_mean_sex      0
dtype: int64

In [66]:
ship.Cabin.value_counts(dropna=False)

Cabin
NaN            687
G6               4
C23 C25 C27      4
B96 B98          4
F2               3
              ...
E17              1
A24              1
C50              1
B42              1
C148             1
Name: count, Length: 148, dtype: int64

In [67]:
ship.Cabin.fillna('UNK',inplace = True)

In [68]:
ship.Cabin.isnull().sum()

np.int64(0)

I chose this method for Cabin, because without any additional external information, we would simply have no way of logically putting in all of the null cabin values tying to a certain person. So isntead of having my dataset skewed due to all of these null values, I deemed it better to rid the values. While I understand by getting rid of all these values could create a bias in data, I believe for a categorical data column like Cabin will not be affected.